Revit 2027 API
Category.GetGraphicsStyle Method
Gets the graphics style associated with this category for the given graphics style type.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public GraphicsStyle GetGraphicsStyle(
	GraphicsStyleType graphicsStyleType
)
Public Function GetGraphicsStyle (
	graphicsStyleType As GraphicsStyleType
) As GraphicsStyle
public:
GraphicsStyle^ GetGraphicsStyle(
	GraphicsStyleType graphicsStyleType
)
member GetGraphicsStyle :
        graphicsStyleType : GraphicsStyleType -> GraphicsStyle
Parameters
graphicsStyleType GraphicsStyleType
The type of graphics style.
Return Value
GraphicsStyle
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  Thrown when the input argument-"graphicsStyleType"-is out of range.
See Also
Reference
Category Class
Autodesk.Revit.DB Namespace